In [11]:
%load_ext sql
%sql mysql+mysqlconnector://root:2004Divya#29@localhost/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%%sql
create database dataanalyst;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [12]:
%%sql 
use dataanalyst;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [3]:
%%sql
create table data(sno int,name varchar(20));

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [5]:
%%sql
select * from data;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [13]:
%%sql
insert into data (sno,name)values(2,"harini");

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [14]:
%%sql
select * from data;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'divya'), (2, 'hari'), (2, 'harini')]

In [15]:
%%sql
update data set name="hari",sno=3 where sno=2;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [16]:
%%sql
select * from data;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'divya'), (3, 'hari'), (3, 'hari')]

In [17]:
%%sql
delete from data where sno=3;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [18]:
%%sql
select * from data;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'divya')]

In [19]:
%%sql
truncate table data;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [20]:
%%sql
select * from data;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [21]:
%%sql
drop table data;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [22]:
%%sql
select * from data;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'dataanalyst.data' doesn't exist
[SQL: select * from data;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [23]:
%%sql
create table student(
    roll_no int,
    name varchar(20)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [25]:
%%sql
desc student;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('roll_no', 'int', 'YES', '', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, ''),
 ('email', 'varchar(30)', 'YES', '', None, '')]

In [24]:
%%sql
Alter table student add email varchar(30);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [30]:
%%sql
Alter table student modify roll_no bigint;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [31]:
%%sql
desc student;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('roll_no', 'bigint', 'YES', '', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, ''),
 ('email', 'varchar(30)', 'YES', '', None, '')]

In [32]:
%%sql
Alter table student rename column roll_no to reg_no;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [33]:
%%sql
desc student;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('reg_no', 'bigint', 'YES', '', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, ''),
 ('email', 'varchar(30)', 'YES', '', None, '')]

In [36]:
%%sql
Alter table student add primary key(reg_no);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [37]:
%%sql
desc student;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('reg_no', 'bigint', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, ''),
 ('email', 'varchar(30)', 'YES', '', None, '')]

In [39]:
%%sql
alter table student drop column email;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [40]:
%%sql
desc student;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('reg_no', 'bigint', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, '')]

In [43]:
%%sql
Rename table student to students;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [45]:
%%sql
desc students;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('reg_no', 'bigint', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, '')]

In [46]:
%%sql
truncate table students;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [48]:
%%sql
desc students;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('reg_no', 'bigint', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, '')]

In [49]:
%%sql
insert into students (reg_no,name)values(1,"divya");

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [50]:
%%sql
desc students;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('reg_no', 'bigint', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, '')]

In [51]:
%%sql
desc students;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('reg_no', 'bigint', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, '')]

In [52]:
%%sql
drop table students;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [53]:
%%sql
desc students;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'dataanalyst.students' doesn't exist
[SQL: desc students;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
#constraints

In [81]:
%%sql
drop table if exists rides;
drop table driver;
create table driver(
    driver_id int primary key,
    driver_name varchar(20) not null,
    license_number varchar(20) unique
);
create table rides(
    ride_id int primary key,
    driver_id int not null,
    pick_up_location varchar(20) ,
    drop_location varchar(20),
    ride_data DATETIME,
    fare decimal(10,2),
    foreign key(driver_id) references driver(driver_id) ON DELETE CASCADE
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [82]:
%%sql
insert into driver(driver_id,driver_name,license_number) 
values(101,"james","xyzsw"),
(102,"jane smith","ABC677");

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [83]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(301,101,"chennai","coimabatore","2024-12-01 08:00:00",500.00),
(302,101,"chennai","madurai","2024-12-01 09:30:00",600.00),
(303,102,"Bangalore","Hyderabad","2024-12-01 10:00:00",700.00);

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[]

In [84]:
%%sql
select * from driver;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(101, 'james', 'xyzsw'), (102, 'jane smith', 'ABC677')]

In [85]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(301, 101, 'chennai', 'coimabatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00')),
 (302, 101, 'chennai', 'madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00')),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 1, 10, 0), Decimal('700.00'))]

In [71]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(304,999,"chennai","coimabatore","2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1452 (23000): Cannot add or update a child row: a foreign key constraint fails (`dataanalyst`.`rides`, CONSTRAINT `rides_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `driver` (`driver_id`))
[SQL: insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare)
values
(304,999,"chennai","coimabatore","2024-12-01 08:00:00",500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [73]:
%%sql
delete from driver where driver_id=101;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1451 (23000): Cannot delete or update a parent row: a foreign key constraint fails (`dataanalyst`.`rides`, CONSTRAINT `rides_ibfk_1` FOREIGN KEY (`driver_id`) REFERENCES `driver` (`driver_id`))
[SQL: delete from driver where driver_id=101;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [74]:
%%sql
delete from rides where driver_id=101;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [75]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 1, 10, 0), Decimal('700.00'))]

In [76]:
%%sql
select * from driver;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(101, 'james', 'xyzsw'), (102, 'jane smith', 'ABC677')]

In [77]:
%%sql
delete from driver where driver_id=101;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [78]:
%%sql
select * from driver;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(102, 'jane smith', 'ABC677')]

In [79]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 1, 10, 0), Decimal('700.00'))]

In [86]:
%%sql
alter table rides add is_delete boolean default false;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [87]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(301, 101, 'chennai', 'coimabatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'), 0),
 (302, 101, 'chennai', 'madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00'), 0),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 1, 10, 0), Decimal('700.00'), 0)]

In [88]:
%%sql
update rides set is_delete=true where driver_id=102;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [89]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(301, 101, 'chennai', 'coimabatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'), 0),
 (302, 101, 'chennai', 'madurai', datetime.datetime(2024, 12, 1, 9, 30), Decimal('600.00'), 0),
 (303, 102, 'Bangalore', 'Hyderabad', datetime.datetime(2024, 12, 1, 10, 0), Decimal('700.00'), 1)]

In [ ]:
# primary key

In [93]:
%%sql
drop table if exists rides;
create table rides(
    ride_id int primary key,
    driver_id int unique,
    pick_up_location varchar(20) not null,
    drop_location varchar(20) not null,
    ride_data DATETIME,
    fare decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [94]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(1,999,"chennai","coimabatore","2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [95]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', 'UNI', None, ''),
 ('pick_up_location', 'varchar(20)', 'NO', '', None, ''),
 ('drop_location', 'varchar(20)', 'NO', '', None, ''),
 ('ride_data', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]

In [96]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 999, 'chennai', 'coimabatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'))]

In [100]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
%(2,999,"chennai","coimabatore","2024-12-01 08:00:00",500.00);values
(1,102,"chennai","coimabatore","2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1' for key 'rides.PRIMARY'
[SQL: insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare)
values
(1,102,"chennai","coimabatore","2024-12-01 08:00:00",500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [101]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(null,102,"chennai","coimabatore","2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1048 (23000): Column 'ride_id' cannot be null
[SQL: insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare)
values
(null,102,"chennai","coimabatore","2024-12-01 08:00:00",500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
# unique key

In [102]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(2,999,"chennai","coimabatore","2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '999' for key 'rides.driver_id'
[SQL: insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare)
values
(2,999,"chennai","coimabatore","2024-12-01 08:00:00",500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [103]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(3,202,"chennai","coimabatore","2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [104]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(4,null,"chennai","coimabatore","2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [105]:
%%sql
select * from rides;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 999, 'chennai', 'coimabatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00')),
 (3, 202, 'chennai', 'coimabatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00')),
 (4, None, 'chennai', 'coimabatore', datetime.datetime(2024, 12, 1, 8, 0), Decimal('500.00'))]

In [ ]:
#composite primary key

In [107]:
%%sql
drop table if exists driver;
create table driver(
    driver_id int ,
    driver_name varchar(20),
    license_number int ,
    primary key(driver_id,license_number)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [108]:
%%sql
insert into driver(driver_id,driver_name,license_number) 
values(101,"james",12),
(102,"jane smith",23);

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [109]:
%%sql
select * from driver

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(101, 'james', 12), (102, 'jane smith', 23)]

In [110]:
%%sql
desc driver;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('driver_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_name', 'varchar(20)', 'YES', '', None, ''),
 ('license_number', 'int', 'NO', 'PRI', None, '')]

In [112]:
%%sql
insert into driver(driver_id,driver_name,license_number) 
values(101,"james",14);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [114]:
%%sql
insert into driver(driver_id,driver_name,license_number) 
values(112,"james",12);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [115]:
%%sql
insert into driver(driver_id,driver_name,license_number) 
values(101,"james",12);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '101-12' for key 'driver.PRIMARY'
[SQL: insert into driver(driver_id,driver_name,license_number)
values(101,"james",12);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
#not null

In [116]:
%%sql
insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare) 
values
(4,null,"chennai",null,"2024-12-01 08:00:00",500.00);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1048 (23000): Column 'drop_location' cannot be null
[SQL: insert into rides(ride_id,driver_id,pick_up_location,drop_location,ride_data,fare)
values
(4,null,"chennai",null,"2024-12-01 08:00:00",500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [117]:
#check

In [118]:
%%sql
create table note(
note_id int,
note_name varchar(20),
price int check(price>100)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [119]:
%%sql
insert into note values(1,"micro",150);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [120]:
%%sql
select * from note;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'micro', 150)]

In [121]:
%%sql
insert into note values(1,"micro",50);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.DatabaseError) 3819 (HY000): Check constraint 'note_chk_1' is violated.
[SQL: insert into note values(1,"micro",50);]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [ ]:
#default

In [123]:
%%sql
create table dish(
    dish_name varchar(25),
    country varchar(20) default "india"
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [125]:
%%sql
insert into dish (dish_name) values("idly");

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [126]:
%%sql
select * from dish;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('idly', 'india')]

In [127]:
%%sql
insert into dish (dish_name,country) values("idly","USA");

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [128]:
%%sql
select * from dish;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('idly', 'india'), ('idly', 'USA')]

In [ ]:
#aggregation functions

In [135]:
%%sql
drop table if exists customer;
create table customer(
id int primary key,
login_device varchar(50),
customer_name varchar(50),
ip_address varchar(50),
product varchar(100),
amount decimal(10,2),
is_placed boolean,
is_viewed boolean,
transaction_status varchar(20)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [136]:
%%sql
insert into customer values
(1,"mobile","ravi","192.16","lap",500.00,true,false,"completed"),
(2,"desktop","ram","192.17","smartphone",2000.00,true,true,"completed"),
(3,"tablet","priya","192.18","shoes",100.00,false,false,"failed"),
(4,"desktop","divi","192.23","watch",5000.00,true,true,"completed"),
(5,"tablet","hari","192.21","lap",2000.00,false,true,"completed"),
(6,"mobile","meena","192.43","headphone",5500.00,true,false,"pending");

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[]

In [137]:
%%sql
select * from customer;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 'mobile', 'ravi', '192.16', 'lap', Decimal('500.00'), 1, 0, 'completed'),
 (2, 'desktop', 'ram', '192.17', 'smartphone', Decimal('2000.00'), 1, 1, 'completed'),
 (3, 'tablet', 'priya', '192.18', 'shoes', Decimal('100.00'), 0, 0, 'failed'),
 (4, 'desktop', 'divi', '192.23', 'watch', Decimal('5000.00'), 1, 1, 'completed'),
 (5, 'tablet', 'hari', '192.21', 'lap', Decimal('2000.00'), 0, 1, 'completed'),
 (6, 'mobile', 'meena', '192.43', 'headphone', Decimal('5500.00'), 1, 0, 'pending')]

In [ ]:
#count()

In [138]:
%%sql
select count(*) from customer;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(6,)]

In [139]:
%%sql
select count(*) from customer where transaction_status="completed";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(4,)]

In [140]:
%%sql
select count(*) from customer where transaction_status="completed" and product="lap";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(2,)]

In [141]:
%%sql
select count(*) from customer where transaction_status="failed" or transaction_status="pending";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(2,)]

In [ ]:
# if want to take data in same coloumn use in operator

In [142]:
%%sql
select count(*) from customer where transaction_status in("failed","pending");

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(2,)]

In [ ]:
#not in means other than failed and pending

In [143]:
%%sql
select count(*) from customer where transaction_status not in("failed","pending");

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(4,)]

In [ ]:
#sum() -alice name using As

In [144]:
%%sql
select sum(amount) from customer where transaction_status="completed";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('9500.00'),)]

In [145]:
%%sql
select sum(amount) as total_transaction from customer where transaction_status="completed";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('9500.00'),)]

In [ ]:
#min()

In [146]:
%%sql
select min(amount) as min_transaction from customer ;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('100.00'),)]

In [ ]:
#max()

In [147]:
%%sql
select max(amount) as max_transaction from customer ;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('5500.00'),)]

In [ ]:
#avg()

In [148]:
%%sql
select avg(amount) as avg_transaction from customer ;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('2516.666667'),)]

In [ ]:
#group by - give more than one answer,if we want who do transaction in mobile it group all mobile and then said answer
#normal aggregate function select single value but group take two or more value as input here login_device and sum() take as input.

In [149]:
%%sql
select login_device,sum(amount) as total_revenue from customer group by login_device;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('mobile', Decimal('6000.00')),
 ('desktop', Decimal('7000.00')),
 ('tablet', Decimal('2100.00'))]

In [ ]:
# having will filter(condition) group by clause it works like where(where clause not works in aggregated column)
# where works in raw data it works before group by but having works after group by clause ,having works only with aggregated function.

In [151]:
%%sql
select login_device,sum(amount) as total_revenue from customer group by login_device having sum(amount)>3000;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('mobile', Decimal('6000.00')), ('desktop', Decimal('7000.00'))]

In [152]:
%%sql
select login_device,sum(amount) as total_revenue from customer where sum(amount)>3000;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.DatabaseError) 1111 (HY000): Invalid use of group function
[SQL: select login_device,sum(amount) as total_revenue from customer where sum(amount)>3000;]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [154]:
%%sql
select login_device,sum(amount) as total_revenue from customer where amount >3000 group by login_device;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('desktop', Decimal('5000.00')), ('mobile', Decimal('5500.00'))]

In [ ]:
# case statement

In [165]:
%%sql
drop table if exists head;
create table head(
    id int ,
    name varchar(20),
    email varchar(25),
    phone_no int,
    amount decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [166]:
%%sql
insert into head values
(101,"ravi","ravi@gmail.com",954632638,5000.00),
(102,"priya",null,921434353,null),
(103,"meena",null,null,1500.00),
(104,"arjun","arjun@gmail.com",null,2500.00),
(105,"karthik","karthik@gmail.com",954632638,3500.00);

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [167]:
%%sql
select * from head;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(101, 'ravi', 'ravi@gmail.com', 954632638, Decimal('5000.00')),
 (102, 'priya', None, 921434353, None),
 (103, 'meena', None, None, Decimal('1500.00')),
 (104, 'arjun', 'arjun@gmail.com', None, Decimal('2500.00')),
 (105, 'karthik', 'karthik@gmail.com', 954632638, Decimal('3500.00'))]

In [168]:
%%sql
select
name,amount,
case 
  when amount>4000 then "high spending"
  when amount between 2000 and 4000 then "medium spending"
  when amount < 2000 then "low spending"
  else "no data"
end as spending
From head;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ravi', Decimal('5000.00'), 'high spending'),
 ('priya', None, 'no data'),
 ('meena', Decimal('1500.00'), 'low spending'),
 ('arjun', Decimal('2500.00'), 'medium spending'),
 ('karthik', Decimal('3500.00'), 'medium spending')]

In [169]:
%%sql
select
name,
case 
  when email is null and phone_no is null then "9999"
  when phone_no is null then email
  else phone_no
end as contact
From head;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ravi', '954632638'),
 ('priya', '921434353'),
 ('meena', '9999'),
 ('arjun', 'arjun@gmail.com'),
 ('karthik', '954632638')]

In [ ]:
#null handling

In [170]:
%%sql
select count(*) from head where phone_no is null;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(2,)]

In [171]:
%%sql
select count(*) from head where phone_no is not null;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(3,)]

In [172]:
%%sql
select id,name,amount,coalesce(amount,"0.00")from head;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(101, 'ravi', Decimal('5000.00'), '5000.00'),
 (102, 'priya', None, '0.00'),
 (103, 'meena', Decimal('1500.00'), '1500.00'),
 (104, 'arjun', Decimal('2500.00'), '2500.00'),
 (105, 'karthik', Decimal('3500.00'), '3500.00')]

In [173]:
%%sql
select id,name,amount,coalesce(amount,null,null,null,"5","0.00",null)from head;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(101, 'ravi', Decimal('5000.00'), '5000.00'),
 (102, 'priya', None, '5'),
 (103, 'meena', Decimal('1500.00'), '1500.00'),
 (104, 'arjun', Decimal('2500.00'), '2500.00'),
 (105, 'karthik', Decimal('3500.00'), '3500.00')]

In [174]:
%%sql
select id,name,amount,IFNULL(amount,"0.00")from head;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(101, 'ravi', Decimal('5000.00'), '5000.00'),
 (102, 'priya', None, '0.00'),
 (103, 'meena', Decimal('1500.00'), '1500.00'),
 (104, 'arjun', Decimal('2500.00'), '2500.00'),
 (105, 'karthik', Decimal('3500.00'), '3500.00')]

In [ ]:
# string handling

In [176]:
%%sql
create table cust_details(
    cust_id int,
    cust_name varchar(20),
    city varchar(25),
    phone int
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [177]:
%%sql
insert into cust_details values
(1,"ravi kumar","chennai",987654321),
(2,"priya sharma","bangalore",123456789),
(3,"divya dharshini","hyderabad",321456781),
(4,"karthik raj","mumbai",654321789);

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [178]:
%%sql
select * from cust_details;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'ravi kumar', 'chennai', 987654321),
 (2, 'priya sharma', 'bangalore', 123456789),
 (3, 'divya dharshini', 'hyderabad', 321456781),
 (4, 'karthik raj', 'mumbai', 654321789)]

In [194]:
%%sql
select
length(cust_name) as name_len, 
upper(cust_name) as upper_name,
lower(cust_name) as lower_name,
concat(cust_name,"_",city) as name_c,
substring(cust_name,1,5) as name_prefix,
trim("  chennai  ") as trim_city,
Lpad(cust_name,15,"*") as left_pad,
Rpad(cust_name,15,"*") as right_pad,
replace(cust_name," ","-") as replace_name,
INSTR(cust_name,"a") as position_of_a,
Left(cust_name,5) as first_left,
Right(cust_name,5) as first_right,
reverse(cust_name) as rev_name,
format(98765432112,2) as form_num
from cust_details;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(10, 'RAVI KUMAR', 'ravi kumar', 'ravi kumar_chennai', 'ravi ', 'chennai', '*****ravi kumar', 'ravi kumar*****', 'ravi-kumar', 2, 'ravi ', 'kumar', 'ramuk ivar', '98,765,432,112.00'),
 (12, 'PRIYA SHARMA', 'priya sharma', 'priya sharma_bangalore', 'priya', 'chennai', '***priya sharma', 'priya sharma***', 'priya-sharma', 5, 'priya', 'harma', 'amrahs ayirp', '98,765,432,112.00'),
 (15, 'DIVYA DHARSHINI', 'divya dharshini', 'divya dharshini_hyderabad', 'divya', 'chennai', 'divya dharshini', 'divya dharshini', 'divya-dharshini', 5, 'divya', 'shini', 'inihsrahd ayvid', '98,765,432,112.00'),
 (11, 'KARTHIK RAJ', 'karthik raj', 'karthik raj_mumbai', 'karth', 'chennai', '****karthik raj', 'karthik raj****', 'karthik-raj', 2, 'karth', 'k raj', 'jar kihtrak', '98,765,432,112.00')]

In [ ]:
# sub queries

In [199]:
%%sql
create table orders(
    order_id int,
    cust_id int,
    order_amt int
);
create table customers(
    cust_id int,
    cust_name varchar(20),
    city varchar(25)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [200]:
%%sql
insert into orders values
(101,1,5000),
(102,2,10000),
(103,3,3000),
(104,4,1500),
(105,5,7000),
(106,6,8000);
insert into customers values
(1,"ravi","chennai"),
(2,"priya","bangalore"),
(3,"divya","hyderabad"),
(4,"meena","mumbai"),
(5,"karthik","chennai");

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.
5 rows affected.

[]

In [203]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(101, 1, 5000),
 (102, 2, 10000),
 (103, 3, 3000),
 (104, 4, 1500),
 (105, 5, 7000),
 (106, 6, 8000)]

In [204]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'ravi', 'chennai'),
 (2, 'priya', 'bangalore'),
 (3, 'divya', 'hyderabad'),
 (4, 'meena', 'mumbai'),
 (5, 'karthik', 'chennai')]

In [205]:
%%sql
select cust_name ,(select max(order_amt) from orders) as max_order_amt from customers;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ravi', 10000),
 ('priya', 10000),
 ('divya', 10000),
 ('meena', 10000),
 ('karthik', 10000)]

In [207]:
%%sql
select cust_name from customers where cust_id IN(select DISTINCT cust_id from orders where order_amt >=5000);

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('ravi',), ('priya',), ('karthik',)]

In [208]:
%%sql
select cust_name from customers where exists(select * from customers where city="chennai");

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ravi',), ('priya',), ('divya',), ('meena',), ('karthik',)]

In [209]:
%%sql
select cust_name ,city ,(select sum(order_amt) from orders o where o.cust_id=c.cust_id) as total_orders from customers c;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ravi', 'chennai', Decimal('5000')),
 ('priya', 'bangalore', Decimal('10000')),
 ('divya', 'hyderabad', Decimal('3000')),
 ('meena', 'mumbai', Decimal('1500')),
 ('karthik', 'chennai', Decimal('7000'))]

In [220]:
%%sql
select 
name_len,
upper_name
from(
select cust_name,
length(cust_name) as name_len, 
upper(cust_name) as upper_name,
lower(cust_name) as lower_name,
concat(cust_name,"_",city) as name_c,
substring(cust_name,1,5) as name_prefix,
trim("  chennai  ") as trim_city,
Lpad(cust_name,15,"*") as left_pad,
Rpad(cust_name,15,"*") as right_pad,
replace(cust_name," ","-") as replace_name,
INSTR(cust_name,"a") as position_of_a,
Left(cust_name,5) as first_left,
Right(cust_name,5) as first_right,
reverse(cust_name) as rev_name,
format(98765432112,2) as form_num
from cust_details)
as subquery;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(10, 'RAVI KUMAR'),
 (12, 'PRIYA SHARMA'),
 (15, 'DIVYA DHARSHINI'),
 (11, 'KARTHIK RAJ')]

In [229]:
%%sql
select cust_name,
case 
   when (select sum(order_amt) from orders where orders.cust_id = customers.cust_id) > (select avg(order_amt) from orders) then "above average"
   else "below average"
end as order_category
from customers ;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('ravi', 'below average'),
 ('priya', 'above average'),
 ('divya', 'below average'),
 ('meena', 'below average'),
 ('karthik', 'above average')]

In [ ]:
# view

In [232]:
%%sql
drop table if exists employees;
create table employees(
    emp_id int ,
    name varchar(20),
    salary decimal(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [234]:
%%sql
insert into employees values
(1,"john",85000.00),
(2,"ram",95000.00),
(3,"taylor",100000.00);

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[]

In [235]:
%%sql
select * from employees;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'john', Decimal('85000.00')),
 (2, 'ram', Decimal('95000.00')),
 (3, 'taylor', Decimal('100000.00'))]

In [236]:
%%sql
select * from employees where salary > 90000;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(2, 'ram', Decimal('95000.00')), (3, 'taylor', Decimal('100000.00'))]

In [239]:
%%sql
create view high_salary as
    select * from employees where salary > 90000;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [240]:
%%sql
select * from high_salary;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(2, 'ram', Decimal('95000.00')), (3, 'taylor', Decimal('100000.00'))]

In [241]:
%%sql
insert into employees values(4,"divi",340000.00);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [242]:
%%sql
select * from high_salary;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(2, 'ram', Decimal('95000.00')),
 (3, 'taylor', Decimal('100000.00')),
 (4, 'divi', Decimal('340000.00'))]

In [9]:
%%sql
create table Restaurants (
    id int primary key,
    name varchar(20),
    location varchar(20)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [29]:
%%sql
drop table if exists orders;
create table orders(
    order_id int ,
    rest_id int ,
    order_date Date
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [30]:
%%sql
insert into Restaurants values
(1,"Bistro","chennai"),
(2,"foodie","bangalore"),
(3,"tasty treat","hyderabad");

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[]

In [34]:
%%sql
insert into orders values
(1,1,"2023-01-01"),
(2,1,"2023-01-02"),
(3,2,"2023-01-05"),
(4,4,"2023-01-07");

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [35]:
%%sql
select * from Restaurants;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'Bistro', 'chennai'),
 (2, 'foodie', 'bangalore'),
 (3, 'tasty treat', 'hyderabad')]

In [36]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 1, datetime.date(2023, 1, 1)),
 (2, 1, datetime.date(2023, 1, 2)),
 (3, 2, datetime.date(2023, 1, 5)),
 (4, 4, datetime.date(2023, 1, 7))]

In [ ]:
# inner join

In [37]:
%%sql
select
r.name as rest_name,
o.order_date
from Restaurants r
join orders o on r.id=o.rest_id;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Bistro', datetime.date(2023, 1, 1)),
 ('Bistro', datetime.date(2023, 1, 2)),
 ('foodie', datetime.date(2023, 1, 5))]

In [ ]:
# left join

In [38]:
%%sql
select
r.name as rest_name,
o.order_date
from Restaurants r
left join orders o on r.id=o.rest_id;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('Bistro', datetime.date(2023, 1, 2)),
 ('Bistro', datetime.date(2023, 1, 1)),
 ('foodie', datetime.date(2023, 1, 5)),
 ('tasty treat', None)]

In [ ]:
# right join

In [39]:
%%sql
select
r.name as rest_name,
o.order_date
from Restaurants r
right join orders o on r.id=o.rest_id;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('Bistro', datetime.date(2023, 1, 1)),
 ('Bistro', datetime.date(2023, 1, 2)),
 ('foodie', datetime.date(2023, 1, 5)),
 (None, datetime.date(2023, 1, 7))]

In [ ]:
# join more than two tables

In [42]:
%%sql
drop table if exists customers;
create table customers(
    cust_id int,
    cust_name varchar(20),
    location varchar(20),
    order_id int
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [43]:
%%sql
insert into customers values
(1,"ravi","chennai",1),
(2,"divu","hyderabad",2),
(3,"ramya","bangalore",3);

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[]

In [44]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'ravi', 'chennai', 1),
 (2, 'divu', 'hyderabad', 2),
 (3, 'ramya', 'bangalore', 3)]

In [46]:
%%sql
select
r.name as rest_name,
o.order_date,
c.cust_name
from Restaurants r
join orders o on r.id = o.rest_id
join customers c on c.order_id = o.order_id;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('Bistro', datetime.date(2023, 1, 1), 'ravi'),
 ('Bistro', datetime.date(2023, 1, 2), 'divu'),
 ('foodie', datetime.date(2023, 1, 5), 'ramya')]

In [ ]:
#self join

In [48]:
%%sql
create table hiring(
    id int,
    name varchar(20),
    manager_id int
);
insert into hiring values
(1,"alice",3),
(2,"bob",3),
(3,"charlie",null),
(4,"diana",3);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
4 rows affected.

[]

In [49]:
%%sql
select * from hiring;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 3), (2, 'bob', 3), (3, 'charlie', None), (4, 'diana', 3)]

In [55]:
%%sql
select
e.name as emp_name,
m.name as manager_name
from hiring e
left join hiring m on e.manager_id =m.id;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('alice', 'charlie'),
 ('bob', 'charlie'),
 ('charlie', None),
 ('diana', 'charlie')]

In [65]:
%%sql
drop table if exists sales;
create table sales(
    trans_id int,
    store varchar(20),
    amt int
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [66]:
%%sql
insert into sales values
(1,"A",100),
(2,"A",200),
(3,"B",150),
(4,"B",250);

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [67]:
%%sql
select * from sales;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'A', 100), (2, 'A', 200), (3, 'B', 150), (4, 'B', 250)]

In [68]:
%%sql
select store ,sum(amt) from sales group by store;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('A', Decimal('300')), ('B', Decimal('400'))]

In [ ]:
#window function - aggregation function

In [73]:
%%sql
select trans_id,store,sum(amt) over(partition by store order by trans_id desc) as total_sales from sales;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(2, 'A', Decimal('200')),
 (1, 'A', Decimal('300')),
 (4, 'B', Decimal('250')),
 (3, 'B', Decimal('400'))]

In [ ]:
# window function - ranking
# ROW_NUMBER()

In [76]:
%%sql
select trans_id,store,amt,ROW_NUMBER() over(partition by store order by trans_id desc) as rownum from sales;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(2, 'A', 200, 1), (1, 'A', 100, 2), (4, 'B', 250, 1), (3, 'B', 150, 2)]

In [ ]:
# remove duplicate

In [84]:
%%sql
drop table if exists emply;
create table emply(
    emp_id int,
    emp_name varchar(20),
    dept varchar(20),
    hiredate date
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [85]:
%%sql
insert into emply values
(1,"alice","hr","2020-05-01"),
(1,"alice","hr","2020-06-01"),
(2,"bob","it","2021-07-01"),
(3,"charlie","finance","2020-09-01"),
(3,"charlie","finance","2022-05-01");

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [86]:
%%sql
select * from emply;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 'hr', datetime.date(2020, 5, 1)),
 (1, 'alice', 'hr', datetime.date(2020, 6, 1)),
 (2, 'bob', 'it', datetime.date(2021, 7, 1)),
 (3, 'charlie', 'finance', datetime.date(2020, 9, 1)),
 (3, 'charlie', 'finance', datetime.date(2022, 5, 1))]

In [87]:
%%sql
select * ,ROW_NUMBER() over(partition by emp_id order by hiredate asc)as rownum from emply;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 'hr', datetime.date(2020, 5, 1), 1),
 (1, 'alice', 'hr', datetime.date(2020, 6, 1), 2),
 (2, 'bob', 'it', datetime.date(2021, 7, 1), 1),
 (3, 'charlie', 'finance', datetime.date(2020, 9, 1), 1),
 (3, 'charlie', 'finance', datetime.date(2022, 5, 1), 2)]

In [89]:
%%sql
with emplyrank as(select * ,ROW_NUMBER() over(partition by emp_id order by hiredate asc)as rownum from emply)
select * from emplyrank where rownum=1;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'alice', 'hr', datetime.date(2020, 5, 1), 1),
 (2, 'bob', 'it', datetime.date(2021, 7, 1), 1),
 (3, 'charlie', 'finance', datetime.date(2020, 9, 1), 1)]

In [ ]:
# rank()

In [91]:
%%sql
drop table if exists student;
create table student(
    stud_id int,
    name varchar(20),
    score int
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [92]:
%%sql
insert into student values
(1,"alice",95),
(2,"bob",90),
(3,"charlie",95),
(4,"david",85);

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [93]:
%%sql
select * from student;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 95), (2, 'bob', 90), (3, 'charlie', 95), (4, 'david', 85)]

In [95]:
%%sql
select * ,rank() over( order by score desc) as exam_Score from student;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 95, 1),
 (3, 'charlie', 95, 1),
 (2, 'bob', 90, 3),
 (4, 'david', 85, 4)]

In [ ]:
# dense_rank()

In [97]:
%%sql
select * ,dense_rank() over( order by score desc) as dense_Score from student;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 95, 1),
 (3, 'charlie', 95, 1),
 (2, 'bob', 90, 2),
 (4, 'david', 85, 3)]

In [ ]:
#percent_rank()

In [98]:
%%sql
select * ,percent_rank() over( order by score desc) as percent from student;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 95, 0.0),
 (3, 'charlie', 95, 0.0),
 (2, 'bob', 90, 0.6666666666666666),
 (4, 'david', 85, 1.0)]

In [103]:
%%sql
select * ,rank() over(order by score desc) as score,percent_rank() over( order by score desc) as percentage from student;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 95, 1, 0.0),
 (3, 'charlie', 95, 1, 0.0),
 (2, 'bob', 90, 3, 0.6666666666666666),
 (4, 'david', 85, 4, 1.0)]

In [ ]:
#ntile

In [111]:
%%sql
drop table if exists stud;
create table stud(
    emp_id int,
    name varchar(20),
    amt int
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [112]:
%%sql
insert into stud values
(1,"alice",110000),
(2,"bob",95000),
(3,"charlie",100000),
(4,"david",60000),
(5,"eva",85000);

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [113]:
%%sql
select * from stud;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 110000),
 (2, 'bob', 95000),
 (3, 'charlie', 100000),
 (4, 'david', 60000),
 (5, 'eva', 85000)]

In [114]:
%%sql
select *,NTILE(3) over(order by amt desc)as ntile_amt from stud;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 110000, 1),
 (3, 'charlie', 100000, 1),
 (2, 'bob', 95000, 2),
 (5, 'eva', 85000, 2),
 (4, 'david', 60000, 3)]

In [ ]:
# window function - values
# lag()

In [115]:
%%sql
create table salaries
(emp_id int,
name varchar(20),
 salary int,
year year
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [116]:
%%sql
insert into salaries values
(1,"alice",5000,2023),
(1,"alice",5500,2024),
(2,"bob",4500,2023),
(2,"bob",4800,2024);

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [117]:
%%sql
select * from salaries;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 5000, 2023),
 (1, 'alice', 5500, 2024),
 (2, 'bob', 4500, 2023),
 (2, 'bob', 4800, 2024)]

In [118]:
%%sql
select * ,lag(salary) over(partition by emp_id order by year) as prev from salaries;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 5000, 2023, None),
 (1, 'alice', 5500, 2024, 5000),
 (2, 'bob', 4500, 2023, None),
 (2, 'bob', 4800, 2024, 4500)]

In [120]:
%%sql
select * ,lag(salary) over(partition by emp_id order by year) as prev,
lag(salary) over(partition by emp_id order by year) -salary as saldiff 
from salaries;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 5000, 2023, None, None),
 (1, 'alice', 5500, 2024, 5000, -500),
 (2, 'bob', 4500, 2023, None, None),
 (2, 'bob', 4800, 2024, 4500, -300)]

In [ ]:
#lead()

In [121]:
%%sql
select * ,lead(salary) over(partition by emp_id order by year) as prev from salaries;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'alice', 5000, 2023, 5500),
 (1, 'alice', 5500, 2024, None),
 (2, 'bob', 4500, 2023, 4800),
 (2, 'bob', 4800, 2024, None)]

In [ ]:
# first_value()

In [122]:
%%sql
create table salary
(emp_id int,
name varchar(20),
 salary int,
year year
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [123]:
%%sql
insert into salary values
(1,"alice",5000,2021),
(1,"alice",5500,2022),
(1,"alice",6000,2023),
(2,"bob",4500,2023),
(2,"bob",4800,2024);

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [124]:
%%sql
select * from salary;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 5000, 2021),
 (1, 'alice', 5500, 2022),
 (1, 'alice', 6000, 2023),
 (2, 'bob', 4500, 2023),
 (2, 'bob', 4800, 2024)]

In [125]:
%%sql
select *,first_value(salary) over(partition by emp_id order by year)as first_sal from salary;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 5000, 2021, 5000),
 (1, 'alice', 5500, 2022, 5000),
 (1, 'alice', 6000, 2023, 5000),
 (2, 'bob', 4500, 2023, 4500),
 (2, 'bob', 4800, 2024, 4500)]

In [ ]:
#last_value()

In [133]:
%%sql
select *,last_value(salary) over(partition by emp_id order by year
ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING)as last_sal from salary;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 5000, 2021, 6000),
 (1, 'alice', 5500, 2022, 6000),
 (1, 'alice', 6000, 2023, 6000),
 (2, 'bob', 4500, 2023, 4800),
 (2, 'bob', 4800, 2024, 4800)]

In [ ]:
# nth_value()

In [137]:
%%sql
select *,nth_value(salary,2) over(partition by emp_id order by year
ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING)as nth_sal from salary;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'alice', 5000, 2021, 5500),
 (1, 'alice', 5500, 2022, 5500),
 (1, 'alice', 6000, 2023, 5500),
 (2, 'bob', 4500, 2023, 4800),
 (2, 'bob', 4800, 2024, 4800)]

In [ ]:
# union all

In [138]:
%%sql
drop table if exists employee;

create table employee
(
    emp_id int,
    name varchar(20),
    pos varchar(20),
    salary int
);
create table contractor
(
    id int,
    name varchar(20),
    pos varchar(20),
    salary int
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [139]:
%%sql
insert into employee values
(1,"alice","dev",1000),
(2,"bob","manager",4000),
(3,"david","dev",5000);
insert into contractor values
(1,"dave","dev",1000),
(2,"bob","manager",23000),
(3,"eva","dev",5000);

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.
3 rows affected.

[]

In [140]:
%%sql 
create table const
( const_id int,
  name varchar(20)
);
insert into const values
(1,"charlie"),
(2,"diya"),
(3,"champ");

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
3 rows affected.

[]

In [141]:
%%sql
select * from employee

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'alice', 'dev', 1000),
 (2, 'bob', 'manager', 4000),
 (3, 'david', 'dev', 5000)]

In [142]:
%%sql
select * from contractor;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'dave', 'dev', 1000),
 (2, 'bob', 'manager', 23000),
 (3, 'eva', 'dev', 5000)]

In [143]:
%%sql
select * from const;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'charlie'), (2, 'diya'), (3, 'champ')]

In [144]:
%%sql
select * from employee
UNION ALL
select * from contractor;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 'alice', 'dev', 1000),
 (2, 'bob', 'manager', 4000),
 (3, 'david', 'dev', 5000),
 (1, 'dave', 'dev', 1000),
 (2, 'bob', 'manager', 23000),
 (3, 'eva', 'dev', 5000)]

In [146]:
%%sql
select * from employee
UNION ALL
select * from contractor
UNION ALL
select * from const;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.DataError) 1222 (21000): The used SELECT statements have a different number of columns
[SQL: select * from employee
UNION ALL
select * from contractor
UNION ALL
select * from const;]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

In [147]:
%%sql
select * from employee
UNION 
select * from contractor

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, 'alice', 'dev', 1000),
 (2, 'bob', 'manager', 4000),
 (3, 'david', 'dev', 5000),
 (1, 'dave', 'dev', 1000),
 (2, 'bob', 'manager', 23000),
 (3, 'eva', 'dev', 5000)]

In [148]:
%%sql
select name,pos from employee
UNION 
select name,pos from contractor

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('alice', 'dev'),
 ('bob', 'manager'),
 ('david', 'dev'),
 ('dave', 'dev'),
 ('eva', 'dev')]

In [150]:
%%sql
select emp_id,name from employee
UNION 
select id,name from contractor
UNION
select const_id,name from const;

 * mysql+mysqlconnector://root:***@localhost/
8 rows affected.

[(1, 'alice'),
 (2, 'bob'),
 (3, 'david'),
 (1, 'dave'),
 (3, 'eva'),
 (1, 'charlie'),
 (2, 'diya'),
 (3, 'champ')]

In [ ]:
# index

In [6]:
%%sql
drop table if exists customer;
create table customer(
    cust_id int,
    name varchar(20),
    email varchar(25)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql
drop table if exists customer1;
create table customer1(
    cust_id int,
    name varchar(20),
    email varchar(25)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [8]:
%%sql
create index indx_email on customer(email);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [9]:
%%sql
insert into customer values
(1,"ravi","ravi@gmail.com"),
(2,"ram","ram@gmail.com"),
(3,"jani","jani@gmail.com");

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[]

In [15]:
%%sql
insert into customer1 values
(1,"ravi","ravi@gmail.com"),
(2,"ram","ram@gmail.com"),
(3,"jani","jani@gmail.com");

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[]

In [10]:
%%sql
select * from customer;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'ravi', 'ravi@gmail.com'),
 (2, 'ram', 'ram@gmail.com'),
 (3, 'jani', 'jani@gmail.com')]

In [16]:
%%sql
select * from customer1;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'ravi', 'ravi@gmail.com'),
 (2, 'ram', 'ram@gmail.com'),
 (3, 'jani', 'jani@gmail.com')]

In [11]:
%%sql
select * from customer where email="jani@gmail.com";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(3, 'jani', 'jani@gmail.com')]

In [12]:
%%sql
Explain
select * from customer where email="jani@gmail.com";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'SIMPLE', 'customer', None, 'ref', 'indx_email', 'indx_email', '103', 'const', 1, 100.0, None)]

In [13]:
%%sql
Explain ANALYZE
select * from customer where email="jani@gmail.com";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[("-> Index lookup on customer using indx_email (email='jani@gmail.com')  (cost=0.35 rows=1) (actual time=0.0455..0.0553 rows=1 loops=1)\n",)]

In [17]:
%%sql
Explain ANALYZE
select * from customer1 where email="jani@gmail.com";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[("-> Filter: (customer1.email = 'jani@gmail.com')  (cost=0.55 rows=1) (actual time=0.947..0.95 rows=1 loops=1)\n    -> Table scan on customer1  (cost=0.55 rows=3) (actual time=0.083..0.0981 rows=3 loops=1)\n",)]

In [ ]:
#partition

In [ ]:
# range partition

In [22]:
%%sql
DROP TABLE IF EXISTS orders;
CREATE TABLE orders (
    order_id   INT AUTO_INCREMENT ,
    order_date DATE NOT NULL, 
    customer_name VARCHAR(50),
    amount     DECIMAL(10,2),
   PRIMARY KEY(order_id, order_date)
)
PARTITION BY RANGE (YEAR(order_date)) (
    PARTITION p_before_2020 VALUES LESS THAN (2020),
    PARTITION p_2020       VALUES LESS THAN (2021),
    PARTITION p_2021       VALUES LESS THAN (2022),
    PARTITION p_2022       VALUES LESS THAN (2023),
    PARTITION p_future     VALUES LESS THAN MAXVALUE
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [23]:
%%sql
INSERT INTO orders (order_date, customer_name, amount)
VALUES
('2019-05-10', 'Alice', 100.00),
('2020-01-15', 'Bob', 200.50),
('2020-12-01', 'Charlie', 300.00),
('2021-07-20', 'Diana', 150.75),
('2022-03-02', 'Edward', 500.00),
('2025-06-18', 'FutureMan', 9999.99);

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[]

In [24]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, datetime.date(2019, 5, 10), 'Alice', Decimal('100.00')),
 (2, datetime.date(2020, 1, 15), 'Bob', Decimal('200.50')),
 (3, datetime.date(2020, 12, 1), 'Charlie', Decimal('300.00')),
 (4, datetime.date(2021, 7, 20), 'Diana', Decimal('150.75')),
 (5, datetime.date(2022, 3, 2), 'Edward', Decimal('500.00')),
 (6, datetime.date(2025, 6, 18), 'FutureMan', Decimal('9999.99'))]

In [ ]:
# partition pruning in range

In [26]:
%%sql
SELECT 
    PARTITION_NAME,
    PARTITION_METHOD,
    PARTITION_EXPRESSION,
    SUBPARTITION_METHOD,
    SUBPARTITION_EXPRESSION
FROM information_schema.PARTITIONS
WHERE TABLE_SCHEMA = 'dataanalyst'
  AND TABLE_NAME   = 'orders';

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('p_future', 'RANGE', 'year(`order_date`)', None, None),
 ('p_2022', 'RANGE', 'year(`order_date`)', None, None),
 ('p_2021', 'RANGE', 'year(`order_date`)', None, None),
 ('p_2020', 'RANGE', 'year(`order_date`)', None, None),
 ('p_before_2020', 'RANGE', 'year(`order_date`)', None, None)]

In [27]:
%%sql
show create table orders;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('orders', 'CREATE TABLE `orders` (\n  `order_id` int NOT NULL AUTO_INCREMENT,\n  `order_date` date NOT NULL,\n  `customer_name` varchar(50) DEFAULT NULL,\n  `am ... (374 characters truncated) ... 2022) ENGINE = InnoDB,\n PARTITION p_2022 VALUES LESS THAN (2023) ENGINE = InnoDB,\n PARTITION p_future VALUES LESS THAN MAXVALUE ENGINE = InnoDB) */')]

In [30]:
%%sql
select * from orders where order_date='2021-07-20' ;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(4, datetime.date(2021, 7, 20), 'Diana', Decimal('150.75'))]

In [32]:
%%sql
explain FORMAT=JSON
select * from orders where year(order_date)='2021-07-20'

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "1.85"\n    },\n    "table": {\n      "table_name": "orders",\n   ... (503 characters truncated) ... ustomer_name",\n        "amount"\n      ],\n      "attached_condition": "(year(`dataanalyst`.`orders`.`order_date`) = \'2021-07-20\')"\n    }\n  }\n}',)]

In [33]:
%%sql
explain FORMAT=JSON
select * from orders where order_date='2021-07-20'

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "0.35"\n    },\n    "table": {\n      "table_name": "orders",\n   ... (417 characters truncated) ... "customer_name",\n        "amount"\n      ],\n      "attached_condition": "(`dataanalyst`.`orders`.`order_date` = DATE\'2021-07-20\')"\n    }\n  }\n}',)]

In [ ]:
# list partition

In [34]:
%%sql
DROP TABLE IF EXISTS employees;
CREATE TABLE employees (
    employee_id INT AUTO_INCREMENT,
    first_name  VARCHAR(50),
    last_name   VARCHAR(50),
    department  VARCHAR(50),
    primary key (employee_id,department)
)
PARTITION BY LIST COLUMNS (department) (
    PARTITION p_sales       VALUES IN ('Sales'),
    PARTITION p_hr          VALUES IN ('HR'),
    PARTITION p_engineering VALUES IN ('Engineering', 'DevOps'),
    PARTITION p_other       VALUES IN ('Finance', 'Marketing', 'Operations')
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [35]:
%%sql
INSERT INTO employees (first_name, last_name, department)
VALUES
('Alice', 'Smith', 'Sales'),
('Bob', 'Johnson', 'HR'),
('Charlie', 'Lee', 'Engineering'),
('Diana', 'Lopez', 'DevOps'),
('Eve', 'Turner', 'Marketing');

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [37]:
%%sql
select * from employees;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Alice', 'Smith', 'Sales'),
 (2, 'Bob', 'Johnson', 'HR'),
 (3, 'Charlie', 'Lee', 'Engineering'),
 (4, 'Diana', 'Lopez', 'DevOps'),
 (5, 'Eve', 'Turner', 'Marketing')]

In [38]:
%%sql
select * from employees where department='Sales'

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'Alice', 'Smith', 'Sales')]

In [40]:
%%sql
Explain format=json
select * from employees where department='Sales'

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "0.35"\n    },\n    "table": {\n      "table_name": "employees",\ ... (418 characters truncated) ...       "last_name",\n        "department"\n      ],\n      "attached_condition": "(`dataanalyst`.`employees`.`department` = \'Sales\')"\n    }\n  }\n}',)]

In [ ]:
# hash partition

In [41]:
%%sql
DROP TABLE IF EXISTS sensor_data;
CREATE TABLE sensor_data (
    sensor_id     INT NOT NULL,
    reading_time  DATETIME NOT NULL,
    reading_value DECIMAL(10,2),
    PRIMARY KEY (sensor_id, reading_time)
)
PARTITION BY HASH(sensor_id)
PARTITIONS 2;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [42]:
%%sql
INSERT INTO sensor_data (sensor_id, reading_time, reading_value)
VALUES
(101, '2025-01-01 10:00:00', 23.50),
(102, '2025-01-01 10:05:00', 24.10),
(103, '2025-01-01 10:10:00', 22.75),
(104, '2025-01-01 10:15:00', 25.00),
(105, '2025-01-01 10:20:00', 20.00),
(106, '2025-01-01 10:25:00', 21.60);

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[]

In [43]:
%%sql
select * from sensor_data;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(102, datetime.datetime(2025, 1, 1, 10, 5), Decimal('24.10')),
 (104, datetime.datetime(2025, 1, 1, 10, 15), Decimal('25.00')),
 (106, datetime.datetime(2025, 1, 1, 10, 25), Decimal('21.60')),
 (101, datetime.datetime(2025, 1, 1, 10, 0), Decimal('23.50')),
 (103, datetime.datetime(2025, 1, 1, 10, 10), Decimal('22.75')),
 (105, datetime.datetime(2025, 1, 1, 10, 20), Decimal('20.00'))]

In [45]:
%%sql
explain format=json
select * from sensor_data where sensor_id=101

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "0.35"\n    },\n    "table": {\n      "table_name": "sensor_data" ... (517 characters truncated) ... ad_per_join": "16"\n      },\n      "used_columns": [\n        "sensor_id",\n        "reading_time",\n        "reading_value"\n      ]\n    }\n  }\n}',)]

In [46]:
%%sql
explain format=json
select * from sensor_data where sensor_id=104

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "0.35"\n    },\n    "table": {\n      "table_name": "sensor_data" ... (517 characters truncated) ... ad_per_join": "16"\n      },\n      "used_columns": [\n        "sensor_id",\n        "reading_time",\n        "reading_value"\n      ]\n    }\n  }\n}',)]

In [ ]:
# subpartition

In [64]:
%%sql
drop table if exists sales_data;
CREATE TABLE sales_data (
    id INT NOT NULL AUTO_INCREMENT,     
    sale_date DATE NOT NULL,            
    amount DECIMAL(10, 2),              
    details TEXT,                       
    PRIMARY KEY (id, sale_date)         
)
PARTITION BY RANGE (YEAR(sale_date)) 
SUBPARTITION BY HASH (MONTH(sale_date))
SUBPARTITIONS 12
(
    PARTITION p_2020 VALUES LESS THAN (2021),
    PARTITION p_2021 VALUES LESS THAN (2022),
    PARTITION p_2022 VALUES LESS THAN (2023),
    PARTITION p_future VALUES LESS THAN MAXVALUE
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [65]:
%%sql
INSERT INTO sales_data (sale_date, amount, details)
VALUES
    ('2020-05-15', 150.00, 'Sale of product A'),
    ('2020-06-10', 200.50, 'Sale of product B'),
    ('2021-03-22', 320.75, 'Sale of product C'),
    ('2021-11-05', 180.00, 'Sale of product D'),
    ('2022-02-14', 250.25, 'Sale of product E'),
    ('2022-09-09', 190.40, 'Sale of product F'),
    ('2023-01-30', 110.60, 'Sale of product G');

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[]

In [66]:
%%sql
select * from sales_data;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[(1, datetime.date(2020, 5, 15), Decimal('150.00'), 'Sale of product A'),
 (2, datetime.date(2020, 6, 10), Decimal('200.50'), 'Sale of product B'),
 (3, datetime.date(2021, 3, 22), Decimal('320.75'), 'Sale of product C'),
 (4, datetime.date(2021, 11, 5), Decimal('180.00'), 'Sale of product D'),
 (5, datetime.date(2022, 2, 14), Decimal('250.25'), 'Sale of product E'),
 (6, datetime.date(2022, 9, 9), Decimal('190.40'), 'Sale of product F'),
 (7, datetime.date(2023, 1, 30), Decimal('110.60'), 'Sale of product G')]

In [73]:
%%sql
explain format=json
select * from sales_data where sale_date= "2021-03-22";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "0.35"\n    },\n    "table": {\n      "table_name": "sales_data", ... (420 characters truncated) ...    "amount",\n        "details"\n      ],\n      "attached_condition": "(`dataanalyst`.`sales_data`.`sale_date` = DATE\'2021-03-22\')"\n    }\n  }\n}',)]

In [75]:
%%sql
select * from sales_data where sale_date= 2021 and sale_date = 11;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [63]:
%%sql
Explain format=json
select * from sales_data where year(sale_date)=2021 and month(sale_date)= 11;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "12.70"\n    },\n    "table": {\n      "table_name": "sales_data" ... (1894 characters truncated) ... ttached_condition": "((year(`dataanalyst`.`sales_data`.`sale_date`) = 2021) and (month(`dataanalyst`.`sales_data`.`sale_date`) = 11))"\n    }\n  }\n}',)]

In [ ]:
# index inside partiton

In [80]:
%%sql
drop table if exists orders;
CREATE TABLE orders (
    order_id      INT AUTO_INCREMENT ,
    order_date    DATE NOT NULL,
    customer_name VARCHAR(50),
    amount        DECIMAL(10,2),
    PRIMARY KEY(order_id ,order_date)
)
PARTITION BY RANGE (YEAR(order_date)) (
    PARTITION p_before_2020 VALUES LESS THAN (2020),
    PARTITION p_2020       VALUES LESS THAN (2021),
    PARTITION p_2021       VALUES LESS THAN (2022),
    PARTITION p_2022       VALUES LESS THAN (2023),
    PARTITION p_future     VALUES LESS THAN MAXVALUE
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [81]:
%%sql
CREATE INDEX idx_order_date ON orders (order_date);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [82]:
%%sql
INSERT INTO orders (order_date, customer_name, amount)
VALUES
('2019-05-10', 'Alice', 100.00),
('2020-01-15', 'Bob', 200.50),
('2020-12-01', 'Charlie', 300.00),
('2021-07-20', 'Diana', 150.75),
('2022-03-02', 'Edward', 500.00),
('2025-06-18', 'FutureMan', 9999.99);

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[]

In [83]:
%%sql
select * from orders;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[(1, datetime.date(2019, 5, 10), 'Alice', Decimal('100.00')),
 (2, datetime.date(2020, 1, 15), 'Bob', Decimal('200.50')),
 (3, datetime.date(2020, 12, 1), 'Charlie', Decimal('300.00')),
 (4, datetime.date(2021, 7, 20), 'Diana', Decimal('150.75')),
 (5, datetime.date(2022, 3, 2), 'Edward', Decimal('500.00')),
 (6, datetime.date(2025, 6, 18), 'FutureMan', Decimal('9999.99'))]

In [84]:
%%sql
SELECT *
FROM orders
WHERE order_date BETWEEN '2020-01-01' AND '2020-12-31';

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(2, datetime.date(2020, 1, 15), 'Bob', Decimal('200.50')),
 (3, datetime.date(2020, 12, 1), 'Charlie', Decimal('300.00'))]

In [93]:
%%sql
drop table if exists location_data;
CREATE TABLE location_data (
    id INT NOT NULL AUTO_INCREMENT, 
    city VARCHAR(50) NOT NULL,      
    area VARCHAR(50),               
    details TEXT,                   
    PRIMARY KEY (id, city)          
)
PARTITION BY LIST COLUMNS(city) (    
    PARTITION p_chennai VALUES IN ('Chennai'),
    PARTITION p_kovai VALUES IN ('Kovai'),
    PARTITION p_tirupur VALUES IN ('Tirupur')
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [94]:
%%sql
CREATE INDEX idx_area1 ON location_data (area);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [95]:
%%sql
INSERT INTO location_data (city, area, details) VALUES 
('Chennai', 'Anna Nagar', 'Residential area'),
 ('Kovai', 'RS Puram', 'Commercial area'),
('Kovai', 'sulur', 'Commercial area'),
('Kovai', 'psg', 'Commercial area'),
('Tirupur', 'avinashi', 'Industrial area');

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [105]:
%%sql
explain format=json
SELECT * FROM location_data WHERE city = 'Kovai' ;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "0.55"\n    },\n    "table": {\n      "table_name": "location_dat ... (396 characters truncated) ... city",\n        "area",\n        "details"\n      ],\n      "attached_condition": "(`dataanalyst`.`location_data`.`city` = \'Kovai\')"\n    }\n  }\n}',)]

In [104]:
%%sql
explain format=json
SELECT * FROM location_data WHERE city = 'Kovai' AND area = 'sulur';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('{\n  "query_block": {\n    "select_id": 1,\n    "cost_info": {\n      "query_cost": "0.35"\n    },\n    "table": {\n      "table_name": "location_dat ... (601 characters truncated) ... _read_per_join": "141"\n      },\n      "used_columns": [\n        "id",\n        "city",\n        "area",\n        "details"\n      ]\n    }\n  }\n}',)]

In [ ]:
# date and functions

In [13]:
%%sql
DROP TABLE IF EXISTS events;
create table events(
    id int AUTO_INCREMENT primary key,
    name varchar(20),
    event_date DATETIME,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql
insert into events (name,event_date) values
("teammeet","2025-01-01 10:30:00"),
("conference","2025-02-03 9:30:00"),
("webinar","2025-05-10 15:45:00"),
("worksho","2025-11-22 13:30:00");

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [15]:
%%sql
select * from events;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'teammeet', datetime.datetime(2025, 1, 1, 10, 30), datetime.datetime(2025, 2, 17, 8, 8, 4)),
 (2, 'conference', datetime.datetime(2025, 2, 3, 9, 30), datetime.datetime(2025, 2, 17, 8, 8, 4)),
 (3, 'webinar', datetime.datetime(2025, 5, 10, 15, 45), datetime.datetime(2025, 2, 17, 8, 8, 4)),
 (4, 'worksho', datetime.datetime(2025, 11, 22, 13, 30), datetime.datetime(2025, 2, 17, 8, 8, 4))]

In [16]:
%%sql
select * ,year(event_date) as year_event from events;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'teammeet', datetime.datetime(2025, 1, 1, 10, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 2025),
 (2, 'conference', datetime.datetime(2025, 2, 3, 9, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 2025),
 (3, 'webinar', datetime.datetime(2025, 5, 10, 15, 45), datetime.datetime(2025, 2, 17, 8, 8, 4), 2025),
 (4, 'worksho', datetime.datetime(2025, 11, 22, 13, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 2025)]

In [17]:
%%sql
select * ,month(event_date) as month_event from events;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'teammeet', datetime.datetime(2025, 1, 1, 10, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 1),
 (2, 'conference', datetime.datetime(2025, 2, 3, 9, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 2),
 (3, 'webinar', datetime.datetime(2025, 5, 10, 15, 45), datetime.datetime(2025, 2, 17, 8, 8, 4), 5),
 (4, 'worksho', datetime.datetime(2025, 11, 22, 13, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 11)]

In [18]:
%%sql
select * ,day(event_date) as day_event from events;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'teammeet', datetime.datetime(2025, 1, 1, 10, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 1),
 (2, 'conference', datetime.datetime(2025, 2, 3, 9, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 3),
 (3, 'webinar', datetime.datetime(2025, 5, 10, 15, 45), datetime.datetime(2025, 2, 17, 8, 8, 4), 10),
 (4, 'worksho', datetime.datetime(2025, 11, 22, 13, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 22)]

In [21]:
%%sql
select id,name,event_date,event_date + INTERVAL 30 Day as date_plus from events;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'teammeet', datetime.datetime(2025, 1, 1, 10, 30), datetime.datetime(2025, 1, 31, 10, 30)),
 (2, 'conference', datetime.datetime(2025, 2, 3, 9, 30), datetime.datetime(2025, 3, 5, 9, 30)),
 (3, 'webinar', datetime.datetime(2025, 5, 10, 15, 45), datetime.datetime(2025, 6, 9, 15, 45)),
 (4, 'worksho', datetime.datetime(2025, 11, 22, 13, 30), datetime.datetime(2025, 12, 22, 13, 30))]

In [22]:
%%sql
select * ,DATE_FORMAT(event_date,"%W %M %e %Y") as date_format from events;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'teammeet', datetime.datetime(2025, 1, 1, 10, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 'Wednesday January 1 2025'),
 (2, 'conference', datetime.datetime(2025, 2, 3, 9, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 'Monday February 3 2025'),
 (3, 'webinar', datetime.datetime(2025, 5, 10, 15, 45), datetime.datetime(2025, 2, 17, 8, 8, 4), 'Saturday May 10 2025'),
 (4, 'worksho', datetime.datetime(2025, 11, 22, 13, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), 'Saturday November 22 2025')]

In [23]:
%%sql
select * ,DATE_FORMAT(event_date,"%h %i %p") as Time_format from events;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'teammeet', datetime.datetime(2025, 1, 1, 10, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), '10 30 AM'),
 (2, 'conference', datetime.datetime(2025, 2, 3, 9, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), '09 30 AM'),
 (3, 'webinar', datetime.datetime(2025, 5, 10, 15, 45), datetime.datetime(2025, 2, 17, 8, 8, 4), '03 45 PM'),
 (4, 'worksho', datetime.datetime(2025, 11, 22, 13, 30), datetime.datetime(2025, 2, 17, 8, 8, 4), '01 30 PM')]

In [24]:
%%sql
select "2025-02-17 08:08:04" as ny_time CONVERT_TZ("2025-02-17 08:08:04",AMERICA/NEWYORK" ,"ASIA/KOLKATA") as i_time ;

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'CONVERT_TZ("2025-02-17 08:08:04",AMERICA/NEWYORK" ,"ASIA/KOLKATA") as i_time' at line 1
[SQL: select "2025-02-17 08:08:04" as ny_time CONVERT_TZ("2025-02-17 08:08:04",AMERICA/NEWYORK" ,"ASIA/KOLKATA") as i_time ;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
# regex

In [13]:
%%sql
drop table if exists regex;
create table regex(
    id int AUTO_INCREMENT primary key,
    text varchar(100)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql
INSERT INTO regex (text) VALUES 
('apple'),         
('Banana'),        
('cherry'),        
('date'),          
('elderberry'),    
('fig'),           
('grape'),         
('honeydew'),      
('running'),       
('123abc');

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[]

In [15]:
%%sql
select * from regex;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running'),
 (10, '123abc')]

In [16]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP '^a';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'apple')]

In [17]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP 'e$';

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'apple'), (4, 'date'), (7, 'grape')]

In [18]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP '^[A-Za-z]';

 * mysql+mysqlconnector://root:***@localhost/
9 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running')]

In [19]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP '^[A-Za-z ]+$';

 * mysql+mysqlconnector://root:***@localhost/
9 rows affected.

[(1, 'apple'),
 (2, 'Banana'),
 (3, 'cherry'),
 (4, 'date'),
 (5, 'elderberry'),
 (6, 'fig'),
 (7, 'grape'),
 (8, 'honeydew'),
 (9, 'running')]

In [20]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP '^[0-9]';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(10, '123abc')]

In [22]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP '(.)\\1';

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'apple'), (3, 'cherry'), (5, 'elderberry'), (9, 'running')]

In [27]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP '^.{5}$';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [28]:
%%sql
SELECT * 
FROM regex
WHERE text REGEXP '^[0-9]{3}[A-Za-z]+$';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [29]:
%%sql
SELECT "2020-12-21"
FROM regex
WHERE text REGEXP '^[0-9][0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]';

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [ ]:
# TCL AND DCL IN MYSQL COMMAND LINE

In [ ]:
# python jdbc

In [ ]:
# normalization

In [ ]:
# non- 1nf

In [30]:
%%sql
CREATE TABLE Students_Non1NF (
    student_id   INT,
    student_name VARCHAR(100),
    phone_numbers VARCHAR(100)  
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [31]:
%%sql
INSERT INTO Students_Non1NF (student_id, student_name, phone_numbers)
VALUES (1, 'Alice', '123-4567,987-6543'),
       (2, 'Bob', '555-1212');

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [32]:
%%sql
select * from Students_Non1NF;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'Alice', '123-4567,987-6543'), (2, 'Bob', '555-1212')]

In [ ]:
# first normalication

In [33]:
%%sql
CREATE TABLE Students (
    student_id   INT PRIMARY KEY,
    student_name VARCHAR(100)
);
CREATE TABLE StudentPhones (
    student_id INT,
    phone      VARCHAR(20),
    PRIMARY KEY (student_id, phone),
    FOREIGN KEY (student_id) REFERENCES Students(student_id)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [34]:
%%sql

INSERT INTO Students (student_id, student_name)
VALUES (1, 'Alice'),
       (2, 'Bob');
INSERT INTO StudentPhones (student_id, phone)
VALUES (1, '123-4567'),
       (1, '987-6543'),
       (2, '555-1212');

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.
3 rows affected.

[]

In [35]:
%%sql
select * from Students

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'Alice'), (2, 'Bob')]

In [36]:
%%sql
select * from StudentPhones;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, '123-4567'), (1, '987-6543'), (2, '555-1212')]

In [37]:
%%sql
select * from students s
join 
StudentPhones p 
on s.student_id	=p.student_id;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'Alice', 1, '123-4567'),
 (1, 'Alice', 1, '987-6543'),
 (2, 'Bob', 2, '555-1212')]

In [ ]:
# non- 2nf

In [38]:
%%sql
CREATE TABLE Enrollment_Non2NF (
    student_id  INT,
    course_id   INT,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    PRIMARY KEY (student_id, course_id)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [39]:
%%sql
INSERT INTO Enrollment_Non2NF (student_id, course_id, course_name, instructor)
VALUES (1, 101, 'Intro to SQL', 'Dr. Smith'),
       (2, 101, 'Intro to SQL', 'Dr. Smith'),
       (1, 102, 'Database Design', 'Dr. Jones');

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[]

In [40]:
%%sql
select * from Enrollment_Non2NF;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 101, 'Intro to SQL', 'Dr. Smith'),
 (1, 102, 'Database Design', 'Dr. Jones'),
 (2, 101, 'Intro to SQL', 'Dr. Smith')]

In [ ]:
# second normalization

In [41]:
%%sql
CREATE TABLE Courses (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100)
);
CREATE TABLE Enrollment (
    student_id INT,
    course_id  INT,
    PRIMARY KEY (student_id, course_id),
    FOREIGN KEY (course_id) REFERENCES Courses(course_id)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [42]:
%%sql
INSERT INTO Courses (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');


INSERT INTO Enrollment (student_id, course_id)
VALUES (1, 101),
       (2, 101),
       (1, 102);

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.
3 rows affected.

[]

In [43]:
%%sql
select * from Courses;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(101, 'Intro to SQL', 'Dr. Smith'), (102, 'Database Design', 'Dr. Jones')]

In [44]:
%%sql
select * from Enrollment;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 101), (2, 101), (1, 102)]

In [ ]:
# non-3nf

In [45]:
%%sql
CREATE TABLE Courses_Non3NF (
    course_id        INT PRIMARY KEY,
    course_name      VARCHAR(100),
    instructor       VARCHAR(100),
    instructor_office VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [46]:
%%sql
INSERT INTO Courses_Non3NF (course_id, course_name, instructor, instructor_office)
VALUES (101, 'Intro to SQL', 'Dr. Smith', 'Room 101'),
       (102, 'Database Design', 'Dr. Jones', 'Room 102');

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[]

In [47]:
%%sql
select * from Courses_Non3NF;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(101, 'Intro to SQL', 'Dr. Smith', 'Room 101'),
 (102, 'Database Design', 'Dr. Jones', 'Room 102')]

In [ ]:
# third normalization

In [52]:
%%sql

drop table if exists instructors;
CREATE TABLE Instructors (
    instructor       VARCHAR(100) PRIMARY KEY,
    instructor_office VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [55]:
%%sql
#drop table if exists courses;
CREATE TABLE Course (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    FOREIGN KEY (instructor) REFERENCES Instructors(instructor)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [56]:
%%sql
INSERT INTO Instructors (instructor, instructor_office)
VALUES ('Dr. Smith', 'Room 101'),
       ('Dr. Jones', 'Room 102');

INSERT INTO Course (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.
2 rows affected.

[]

In [57]:
%%sql
select * from Instructors;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('Dr. Jones', 'Room 102'), ('Dr. Smith', 'Room 101')]

In [58]:
%%sql
select * from Course;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(101, 'Intro to SQL', 'Dr. Smith'), (102, 'Database Design', 'Dr. Jones')]

In [ ]:
#non -bcnf

In [62]:
%%sql
create table subject(
    stu_id int ,
    sub varchar(20),
    proffesor varchar(20),
    primary key(stu_id,sub)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [63]:
%%sql
insert into subject values
(101,"java","p.jave"),
(101,"c++","p.raj"),
(102,"java","p.kandle"),
(103,"c++","p.charlie");

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [64]:
%%sql
select * from subject;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(101, 'c++', 'p.raj'),
 (101, 'java', 'p.jave'),
 (102, 'java', 'p.kandle'),
 (103, 'c++', 'p.charlie')]

In [ ]:
# bcnf

In [71]:
%%sql
drop table if exists clg;
create table clg(
    stud_id int ,
    sub varchar(20),
    primary key(stud_id,sub)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [79]:
%%sql
drop table if exists subject;
create table subject(
    sub varchar(20),
    proffesor varchar(20)
   
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [81]:
%%sql
insert into clg values
(101,"java"),
(101,"c++"),
(102,"java"),
(103,"c++");

insert into subject values
("java","p.java"),
("c++","p.raj"),
("java","p.snan"),
("c++","p.charlie");

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.
4 rows affected.

[]

In [83]:
%%sql
select * from subject;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('java', 'p.java'),
 ('c++', 'p.raj'),
 ('java', 'p.snan'),
 ('c++', 'p.charlie')]

In [82]:
%%sql
select * from clg;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(101, 'c++'), (101, 'java'), (102, 'java'), (103, 'c++')]

In [ ]:
# non-4NF

In [90]:
%%sql
drop table if exists eml;
create table eml(
    roll_no int,
    course varchar(20),
    hobby varchar(20)
);
insert into eml values
(501,"java","draw"),
(501,"sql","cricket"),
(502,"c#","dance"),
(502,"python","gaming"),
(503,"php","draw");

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [91]:
%%sql
select * from eml;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(501, 'java', 'draw'),
 (501, 'sql', 'cricket'),
 (502, 'c#', 'dance'),
 (502, 'python', 'gaming'),
 (503, 'php', 'draw')]

In [ ]:
# 4nf

In [92]:
%%sql
create table cou(
    roll_no int,
    course varchar(20)
);
create table hob(
    roll_no int,
    hobby varchar(20)
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [93]:
%%sql
insert into cou values
(501,"java"),
(501,"sql"),
(502,"c#"),
(502,"python"),
(503,"php");

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [94]:
%%sql
insert into hob values
(501,"draw"),
(501,"cricket"),
(502,"dance"),
(502,"gaming"),
(503,"draw");

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[]

In [95]:
%%sql
select * from cou;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(501, 'java'), (501, 'sql'), (502, 'c#'), (502, 'python'), (503, 'php')]

In [96]:
%%sql
select * from hob;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(501, 'draw'),
 (501, 'cricket'),
 (502, 'dance'),
 (502, 'gaming'),
 (503, 'draw')]

In [ ]:
# non-5nf

In [98]:
%%sql
drop table if exists agent;
create table agent(
    agent varchar(20),
    company varchar(20),
    product varchar(20)
);
insert into agent values
("smith","ford","car"),
("smith","ford","truck"),
("smith","GM","car"),
("smith","GM","truck"),
("jones","ford","car");

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [99]:
%%sql
select * from agent;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('smith', 'ford', 'car'),
 ('smith', 'ford', 'truck'),
 ('smith', 'GM', 'car'),
 ('smith', 'GM', 'truck'),
 ('jones', 'ford', 'car')]

In [ ]:
# 5nf

In [121]:
%%sql
DROP TABLE IF EXISTS com;
CREATE TABLE com (
    agent VARCHAR(20),
    company VARCHAR(20) PRIMARY KEY
);
DROP TABLE IF EXISTS age;
CREATE TABLE age (
    company VARCHAR(20),
    product VARCHAR(20) PRIMARY KEY,
    FOREIGN KEY (company) REFERENCES com(company)  
);
DROP TABLE IF EXISTS pro;
CREATE TABLE pro (
    agent VARCHAR(20),
    product VARCHAR(20),
    FOREIGN KEY (product) REFERENCES age(product) 
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [122]:
%%sql
insert into com values
("smith","ford"),
("smith","GM"),
("jones","ford");
insert into age values
("ford","car"),
("ford","truck"),
("GM","car"),
("GM","truck");
insert into pro values
("smith","car"),
("smith","truck"),
("jones","car");

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry 'ford' for key 'com.PRIMARY'
[SQL: insert into com values
("smith","ford"),
("smith","GM"),
("jones","ford");]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [107]:
%%sql
select * from com;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('smith', 'ford'), ('smith', 'GM'), ('jones', 'ford')]

In [108]:
%%sql
select * from age;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('ford', 'car'), ('ford', 'truck'), ('GM', 'car'), ('GM', 'truck')]

In [109]:
%%sql
select * from pro;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('smith', 'car'), ('smith', 'truck'), ('jones', 'car')]

In [115]:
%%sql
select * from com c 
join age a 
on c.company=a.company ;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[('jones', 'ford', 'ford', 'car'),
 ('smith', 'ford', 'ford', 'car'),
 ('jones', 'ford', 'ford', 'truck'),
 ('smith', 'ford', 'ford', 'truck'),
 ('smith', 'GM', 'GM', 'car'),
 ('smith', 'GM', 'GM', 'truck')]

In [ ]:
# 5nf ,4nf ,bcnf are not mostly used in real time these error occur very rarely so i didnt implement 5nf query

In [ ]:
# slow changing dimension
# 1. overwrite

In [124]:
%%sql
create table product (
    pro_id int ,
    pro_title varchar(20),
    category varchar(20),
    brand varchar(20)
);
insert into product values
(101,"amazon ec2 3rd gen","shoes","amazon");

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
1 rows affected.

[]

In [125]:
%%sql
select * from product;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(101, 'amazon ec2 3rd gen', 'shoes', 'amazon')]

In [126]:
%%sql
update product set pro_title="amazon ec2 (3rd gen)" where pro_id =101;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [127]:
%%sql
select * from product;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(101, 'amazon ec2 (3rd gen)', 'shoes', 'amazon')]

In [ ]:
#2.add new record

In [128]:
%%sql
create table seller (
    sell_id int,
    location varchar(20),
    start_date DATE,
    end_date Date,
    is_current boolean
);
insert into seller values
(501,"tirupur","2021-06-06",null,TRUE);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
1 rows affected.

[]

In [129]:
%%sql
select * from seller;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(501, 'tirupur', datetime.date(2021, 6, 6), None, 1)]

In [130]:
%%sql
update seller set end_date="2025-05-01",is_current=FALSE where sell_id=501 and is_current=TRUE;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [131]:
%%sql
select * from seller;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(501, 'tirupur', datetime.date(2021, 6, 6), datetime.date(2025, 5, 1), 0)]

In [132]:
%%sql
insert into seller values
(501,"bangalore","2025-06-06",null,TRUE);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [133]:
%%sql
select * from seller;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(501, 'tirupur', datetime.date(2021, 6, 6), datetime.date(2025, 5, 1), 0),
 (501, 'bangalore', datetime.date(2025, 6, 6), None, 1)]

In [ ]:
#add new attribute

In [134]:
%%sql
create table product1 (
    pro_id int ,
    pro_title varchar(20),
    current_category varchar(20),
    previous_category varchar(20) 
);
insert into product1 values
(101,"tv stick","streaming devices",null);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
1 rows affected.

[]

In [135]:
%%sql
select * from  product1;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(101, 'tv stick', 'streaming devices', None)]

In [136]:
%%sql
update product1 set previous_category=current_category,current_category="media players" where pro_id=101;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [137]:
%%sql
select * from  product1;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(101, 'tv stick', 'media players', 'streaming devices')]

In [138]:
%%sql
update product1 set previous_category=current_category,current_category="jio hotstar" where pro_id=101;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [139]:
%%sql
select * from  product1;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(101, 'tv stick', 'jio hotstar', 'media players')]